# Data Cleaning  
Link to the data can be found here: [2006 - 2012 Math Test Results - All Students](https://data.cityofnewyork.us/Education/2006-2012-Math-Test-Results-All-Students/3mrr-8h5c)

In [138]:
# Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Column explanation:  
__DBN__ => District Borough Number, unique id of the school  
__Grade__ => Grade of the students. Grade 3 to 8 (2de leerjaar tot 2de middelbaar) or all grades  
__Year__ => School year, 2006-2012  
__Demographics__ => "All students"  
__Number Tested__ => Amount of students that were tested  
__Mean Scale Score__ => Average performance from the group of students   
__Num Level x__ => Found this when researching: [Explanation](https://www.lumoslearning.com/llwp/teachers-speak/new-york-state-test-scores-rankings.html) New York State assigns Performance Levels 4, 3, 2, and 1 to scale scores on the test. Students can score a Level 4 through Level 1 on the test, depending on their scale score. Level 1 is the worst and level 4 is the best.    
__Pct Level x__ => Percent of students in this level

In [139]:
# Load and show data
math_results_df = pd.read_csv('Math_Test_Results.csv')
math_results_df

,DBN,Grade,Year,Demographic,Number Tested,Mean Scale Score,Num Level 1,Pct Level 1,Num Level 2,Pct Level 2,Num Level 3,Pct Level 3,Num Level 4,Pct Level 4,Num Level 3 and 4,Pct Level 3 and 4
0,01M015,3,2006,All Students,39,667,2,5.1,11,28.2,20,51.3,6,15.4,26,66.7
1,01M015,3,2007,All Students,31,672,2,6.5,3,9.7,22,71,4,12.9,26,83.9
2,01M015,3,2008,All Students,37,668,0,0,6,16.2,29,78.4,2,5.4,31,83.8
3,01M015,3,2009,All Students,33,668,0,0,4,12.1,28,84.8,1,3,29,87.9
4,01M015,3,2010,All Students,26,677,6,23.1,12,46.2,6,23.1,2,7.7,8,30.8
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33456,75X723,All Grades,2008,All Students,211,NaN,139,65.9,46,21.8,26,12.3,0,0,26,12.3
33457,75X723,All Grades,2009,All Students,209,NaN,88,42.1,87,41.6,30,14.4,4,1.9,34,16.3
33458,75X723,All Grades,2010,All Students,242,NaN,157,64.9,75,31,10,4.1,0,0,10,4.1
33459,75X723,All Grades,2011,All Students,229,617,153,66.8,67,29.3,8,3.5,1,0.4,9,3.9
33460,75X723,All Grades,2012,All Students,213,620,142,66.7,67,31.5,4,1.9,0,0,4,1.9

In [140]:
math_results_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33461 entries, 0 to 33460
Data columns (total 16 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   DBN                33461 non-null  object
 1   Grade              33461 non-null  object
 2   Year               33461 non-null  int64
 3   Demographic        33461 non-null  object
 4   Number Tested      33461 non-null  int64
 5   Mean Scale Score   28106 non-null  object
 6   Num Level 1        33461 non-null  object
 7   Pct Level 1        33461 non-null  object
 8   Num Level 2        33461 non-null  object
 9   Pct Level 2        33461 non-null  object
 10  Num Level 3        33461 non-null  object
 11  Pct Level 3        33461 non-null  object
 12  Num Level 4        33461 non-null  object
 13  Pct Level 4        33461 non-null  object
 14  Num Level 3 and 4  33461 non-null  object
 15  Pct Level 3 and 4  33461 non-null  object
dtypes: int64(2), object(14)
memory usage: 4.1+ MB

In [141]:
math_results_df.isnull().any()

DBN                  False
Grade                False
Year                 False
Demographic          False
Number Tested        False
Mean Scale Score      True
Num Level 1          False
Pct Level 1          False
Num Level 2          False
Pct Level 2          False
Num Level 3          False
Pct Level 3          False
Num Level 4          False
Pct Level 4          False
Num Level 3 and 4    False
Pct Level 3 and 4    False
dtype: bool

# Cleaning
### DBN
I'm going to start with DBN.  
This number is the combination of the District Number, the letter code for the borough, and the number of the school.  
I will split this column into 3 different columns

In [142]:
math_results_df['District Number'] = math_results_df['DBN'].apply(lambda x: x[:2])
math_results_df['Borough Number'] = math_results_df['DBN'].apply(lambda x: x[2])
math_results_df['School Number'] = math_results_df['DBN'].apply(lambda x: x[3:])
math_results_df.drop('DBN', axis=1, inplace=True)

math_results_df.head()

,Grade,Year,Demographic,Number Tested,Mean Scale Score,Num Level 1,Pct Level 1,Num Level 2,Pct Level 2,Num Level 3,Pct Level 3,Num Level 4,Pct Level 4,Num Level 3 and 4,Pct Level 3 and 4,District Number,Borough Number,School Number
0,3,2006,All Students,39,667,2,5.1,11,28.2,20,51.3,6,15.4,26,66.7,01,M,015
1,3,2007,All Students,31,672,2,6.5,3,9.7,22,71,4,12.9,26,83.9,01,M,015
2,3,2008,All Students,37,668,0,0,6,16.2,29,78.4,2,5.4,31,83.8,01,M,015
3,3,2009,All Students,33,668,0,0,4,12.1,28,84.8,1,3,29,87.9,01,M,015
4,3,2010,All Students,26,677,6,23.1,12,46.2,6,23.1,2,7.7,8,30.8,01,M,015

The Borough Number exists out of a couple different letters

In [143]:
math_results_df['Borough Number'].unique()

array(['M', 'X', 'K', 'Q', 'R'], dtype=object)

I will use encoding to replace these letters with integers.

In [144]:
encoding = {'M':0, 'X':1, 'K':2, 'Q':3, 'R':4}
math_results_df['Borough Number'] = math_results_df['Borough Number'].replace(encoding)
math_results_df['Borough Number'].unique()

array([0, 1, 2, 3, 4])

### Grade
Next we have the Grade  
Let's check all the unique values

In [145]:
math_results_df['Grade'].unique()

array(['3', '4', '5', '6', 'All Grades', '7', '8'], dtype=object)

These are all integers exept "All Grades"  
I will replace this string with the number 0 as encoding
Next convert the dtype of the column from object to int.

In [146]:
math_results_df['Grade'] = math_results_df['Grade'].replace("All Grades", 0)
math_results_df['Grade'] = math_results_df['Grade'].astype("int")
math_results_df['Grade'].unique()

array([3, 4, 5, 6, 0, 7, 8])

### Year
I will do the same and check all the unique values first.  
This doesn't need cleaning and the dtype is already int

In [147]:
math_results_df['Year'].unique()

array([2006, 2007, 2008, 2009, 2010, 2011, 2012])

### Demographic
This column has a constant value so we can delete this because it's not useful

In [148]:
math_results_df['Demographic'].unique()

array(['All Students'], dtype=object)

In [149]:
math_results_df.drop('Demographic', axis=1, inplace=True)

### Number Tested
Every value in this column has to be an int.  
This function checks this and return all the values that are not an int

In [150]:
math_results_df.loc[~math_results_df['Number Tested'].astype(str).str.isdigit(), 'Number Tested'].tolist()

[]

In [151]:
math_results_df['Number Tested'].describe()

count    33461.000000
mean       172.754132
std        197.130818
min          1.000000
25%         65.000000
50%        106.000000
75%        204.000000
max       2282.000000
Name: Number Tested, dtype: float64

### Mean Scale Score
This column does not only exists out of integers.

In [152]:
non_int = math_results_df.loc[~math_results_df['Mean Scale Score'].astype(str).str.isdigit(),
                              'Mean Scale Score'].tolist()
set(non_int)

{nan, 's'}

In [153]:
print("amount of wrong values: " + str(pd.Series(non_int).value_counts()))
print("amount of nan values: " + str(pd.Series(non_int).isna().sum()))

amount of wrong values: s    471
dtype: int64
amount of nan values: 5355

I will drop all these rows because this is an important number and cannot be guessed

In [154]:
# drop all NaN values
math_results_df = math_results_df.dropna(subset = ['Mean Scale Score'])
math_results_df.shape

(28106, 17)

In [155]:
# drop all not integer values

math_results_df = math_results_df[math_results_df['Mean Scale Score'].apply(lambda x: str(x).isdigit())]
math_results_df.shape

(27635, 17)

### Num Level x
The columns 'Num Level 3 and 4' and 'Pct Level 3 and 4' are redundant so I will delete these.  
First check if there are any NaN values in these columns

In [156]:
math_results_df.drop('Num Level 3 and 4', axis=1, inplace=True)
math_results_df.drop('Pct Level 3 and 4', axis=1, inplace=True)
print("Num Level 1 NaN: " + str(math_results_df['Num Level 1'].isna().sum()))
print("Num Level 2 NaN: " + str(math_results_df['Num Level 2'].isna().sum()))
print("Num Level 3 NaN: " + str(math_results_df['Num Level 3'].isna().sum()))
print("Num Level 4 NaN: " + str(math_results_df['Num Level 4'].isna().sum()))

Num Level 1 NaN: 0
Num Level 2 NaN: 0
Num Level 3 NaN: 0
Num Level 4 NaN: 0

No NaN values found!  
Let's convert the columns to int columns

In [157]:
math_results_df['Num Level 1'] = math_results_df['Num Level 1'].astype("int")
math_results_df['Num Level 2'] = math_results_df['Num Level 2'].astype("int")
math_results_df['Num Level 3'] = math_results_df['Num Level 3'].astype("int")
math_results_df['Num Level 4'] = math_results_df['Num Level 4'].astype("int")
math_results_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 27635 entries, 0 to 33460
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Grade             27635 non-null  int64
 1   Year              27635 non-null  int64
 2   Number Tested     27635 non-null  int64
 3   Mean Scale Score  27635 non-null  object
 4   Num Level 1       27635 non-null  int64
 5   Pct Level 1       27635 non-null  object
 6   Num Level 2       27635 non-null  int64
 7   Pct Level 2       27635 non-null  object
 8   Num Level 3       27635 non-null  int64
 9   Pct Level 3       27635 non-null  object
 10  Num Level 4       27635 non-null  int64
 11  Pct Level 4       27635 non-null  object
 12  District Number   27635 non-null  object
 13  Borough Number    27635 non-null  int64
 14  School Number     27635 non-null  object
dtypes: int64(8), object(7)
memory usage: 3.4+ MB

### Pct Level x
I will check again if there are Nan values in these columns

In [158]:
print("Pct Level 1 NaN: " + str(math_results_df['Pct Level 1'].isna().sum()))
print("Pct Level 2 NaN: " + str(math_results_df['Pct Level 2'].isna().sum()))
print("Pct Level 3 NaN: " + str(math_results_df['Pct Level 3'].isna().sum()))
print("Pct Level 4 NaN: " + str(math_results_df['Pct Level 4'].isna().sum()))

Pct Level 1 NaN: 0
Pct Level 2 NaN: 0
Pct Level 3 NaN: 0
Pct Level 4 NaN: 0

nowp no NaN's  
We can convert these columns to float

In [159]:
math_results_df['Pct Level 1'] = math_results_df['Pct Level 1'].astype("float")
math_results_df['Pct Level 2'] = math_results_df['Pct Level 2'].astype("float")
math_results_df['Pct Level 3'] = math_results_df['Pct Level 3'].astype("float")
math_results_df['Pct Level 4'] = math_results_df['Pct Level 4'].astype("float")

math_results_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 27635 entries, 0 to 33460
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Grade             27635 non-null  int64
 1   Year              27635 non-null  int64
 2   Number Tested     27635 non-null  int64
 3   Mean Scale Score  27635 non-null  object
 4   Num Level 1       27635 non-null  int64
 5   Pct Level 1       27635 non-null  float64
 6   Num Level 2       27635 non-null  int64
 7   Pct Level 2       27635 non-null  float64
 8   Num Level 3       27635 non-null  int64
 9   Pct Level 3       27635 non-null  float64
 10  Num Level 4       27635 non-null  int64
 11  Pct Level 4       27635 non-null  float64
 12  District Number   27635 non-null  object
 13  Borough Number    27635 non-null  int64
 14  School Number     27635 non-null  object
dtypes: float64(4), int64(8), object(3)
memory usage: 3.4+ MB

Because these values are percent values, the values should fall in between 0 and 100.  
We can see that this is fine!

In [160]:
print("min pct level 1: " + str(math_results_df['Pct Level 1'].min()))
print("min pct level 2: " + str(math_results_df['Pct Level 2'].min()))
print("min pct level 3: " + str(math_results_df['Pct Level 3'].min()))
print("min pct level 4: " + str(math_results_df['Pct Level 4'].min()))

print("max pct level 1: " + str(math_results_df['Pct Level 1'].max()))
print("max pct level 2: " + str(math_results_df['Pct Level 2'].max()))
print("max pct level 3: " + str(math_results_df['Pct Level 3'].max()))
print("max pct level 4: " + str(math_results_df['Pct Level 4'].max()))

min pct level 1: 0.0
min pct level 2: 0.0
min pct level 3: 0.0
min pct level 4: 0.0
max pct level 1: 100.0
max pct level 2: 100.0
max pct level 3: 100.0
max pct level 4: 100.0

The data is cleaned and this is the resulted dataframe:  
Next, we can start data exploration

In [161]:
math_results_df

,Grade,Year,Number Tested,Mean Scale Score,Num Level 1,Pct Level 1,Num Level 2,Pct Level 2,Num Level 3,Pct Level 3,Num Level 4,Pct Level 4,District Number,Borough Number,School Number
0,3,2006,39,667,2,5.1,11,28.2,20,51.3,6,15.4,01,0,015
1,3,2007,31,672,2,6.5,3,9.7,22,71.0,4,12.9,01,0,015
2,3,2008,37,668,0,0.0,6,16.2,29,78.4,2,5.4,01,0,015
3,3,2009,33,668,0,0.0,4,12.1,28,84.8,1,3.0,01,0,015
4,3,2010,26,677,6,23.1,12,46.2,6,23.1,2,7.7,01,0,015
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33451,8,2010,38,598,32,84.2,6,15.8,0,0.0,0,0.0,75,1,723
33452,8,2011,32,595,24,75.0,7,21.9,1,3.1,0,0.0,75,1,723
33453,8,2012,17,632,8,47.1,9,52.9,0,0.0,0,0.0,75,1,723
33459,0,2011,229,617,153,66.8,67,29.3,8,3.5,1,0.4,75,1,723
33460,0,2012,213,620,142,66.7,67,31.5,4,1.9,0,0.0,75,1,723

After a closer look, I found out that data from students in all grades took together is also redundant data.  
I will remove those columns because this is not usefull for my prediction

In [165]:
math_results_df = math_results_df[math_results_df['Grade'] != 0]
math_results_df

,Grade,Year,Number Tested,Mean Scale Score,Num Level 1,Pct Level 1,Num Level 2,Pct Level 2,Num Level 3,Pct Level 3,Num Level 4,Pct Level 4,District Number,Borough Number,School Number
0,3,2006,39,667,2,5.1,11,28.2,20,51.3,6,15.4,01,0,015
1,3,2007,31,672,2,6.5,3,9.7,22,71.0,4,12.9,01,0,015
2,3,2008,37,668,0,0.0,6,16.2,29,78.4,2,5.4,01,0,015
3,3,2009,33,668,0,0.0,4,12.1,28,84.8,1,3.0,01,0,015
4,3,2010,26,677,6,23.1,12,46.2,6,23.1,2,7.7,01,0,015
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33449,8,2008,36,567,34,94.4,2,5.6,0,0.0,0,0.0,75,1,723
33450,8,2009,31,597,18,58.1,13,41.9,0,0.0,0,0.0,75,1,723
33451,8,2010,38,598,32,84.2,6,15.8,0,0.0,0,0.0,75,1,723
33452,8,2011,32,595,24,75.0,7,21.9,1,3.1,0,0.0,75,1,723
33453,8,2012,17,632,8,47.1,9,52.9,0,0.0,0,0.0,75,1,723

This in total leaves us with 25391 rows and 15 columns.

In [166]:
# Save the Dataframe
math_results_df.to_csv("Math_Test_Results_Cleaned.csv", index=False)